---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.GetTreadsLength
source: html/8eb5367a-1085-5729-9228-5648cad72e9a.htm
---
# Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.GetTreadsLength Method

Gets the length of treads.

## Syntax (C#)
```csharp
public IList<double> GetTreadsLength()
```

## Returns
The length of treads.